# Analise usando Querys

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data = pd.read_csv('Dados/Mall_Customers.csv')
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
data.shape

(200, 5)

In [5]:
data.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [6]:
print("Minimum Age :", data['Age'].min())
print("Maximum Age :", data['Age'].max())

Minimum Age : 18
Maximum Age : 70

In [7]:
# Definindo um novo parametro para idade
def age(x):
    if x <= 35:
        return "Young"
    else:
        return "Old"
    
data['Age'] = data['Age'].apply(age)
data['Age'].value_counts()

Old      102
Young     98
Name: Age, dtype: int64

In [8]:
# Impacto dos Gastos em diferentes faixas et√°rias
data[['Age', 'Spending Score (1-100)']].groupby(['Age']).agg(['min','mean','max']).style.background_gradient(cmap = 'copper')

In [9]:
# 10 Principais Clientes-Alvo
data[['Annual Income (k$)','Spending Score (1-100)']].head()

   Annual Income (k$)  Spending Score (1-100)
0                  15                      39
1                  15                      81
2                  16                       6
3                  16                      77
4                  17                      40

In [10]:
# Principais Clientes
data[['CustomerID','Annual Income (k$)','Spending Score (1-100)']][(data['Annual Income (k$)'] > 75)
        & (data['Spending Score (1-100)'] > 75)].sort_values(by = 'Spending Score (1-100)', ascending = False).head(10)

     CustomerID  Annual Income (k$)  Spending Score (1-100)
185         186                  99                      97
145         146                  77                      97
167         168                  86                      95
163         164                  81                      93
173         174                  87                      92
193         194                 113                      91
179         180                  93                      90
149         150                  78                      90
155         156                  78                      89
151         152                  78                      88